// Lab_03_2.cpp
// Řęđčíäŕ Âîëîäčěčđ
// Ëŕáîđŕňîđíŕ đîáîňŕ š 3.2
// Đîçăŕëóćĺíí˙, çŕäŕíĺ ôîđěóëîţ: ôóíęöł˙ ç ďŕđŕěĺňđŕěč.
// Âŕđłŕíň 22
#include <iostream>
using namespace std;
int main()
{
	double x; // âőłäíčé ŕđăóěĺíň
	double a; // âőłäíčé ďŕđŕěĺňđ
	double b; // âőłäíčé ďŕđŕěĺňđ
	double c; // âőłäíčé ďŕđŕěĺňđ
	double F; // đĺçóëüňŕň îá÷čńëĺíí˙ âčđŕçó
	cout << "a = "; cin >> a;
	cout << "b = "; cin >> b;
	cout << "c = "; cin >> c;
	cout << "x = "; cin >> x;

	// ńďîńłá 1: đîçăŕëóćĺíí˙ â ńęîđî÷ĺíłé ôîđěł
	if (c == 0 < 0 && x + 5 < 0)
		F = (1/(a*x))-b;
	if (x + 5 > 0 && c!= 0)
		F = (x-a)/x;
	if (!(x + 5 < 0 && c == 0) && !((x + 5 > 0 && c != 0)))
		F = (10*x)/(c - 4);
	cout << endl;
	cout << "1) F = " << F << endl;
	// ńďîńłá 2: đîçăŕëóćĺíí˙ â ďîâíłé ôîđěł
	if (x + 5 < 0 && c == 0)
		F = (1 / (a * x)) - b;
	else
		if (x + 5 > 0 && c	!= 0)
			F = (x - a) / x;
		else
			F = (10 * x) / (c - 4);
	cout << "2) F = " << F << endl;
	cin.get();
	return 0;
}
